#+FILETAGS: :web-utils:

* backlog
** TODO write tests
   :CLOCK:
   CLOCK: [2014-02-20 Thu 16:13]--[2014-02-20 Thu 16:22] =>  0:09
   CLOCK: [2014-02-20 Thu 15:33]--[2014-02-20 Thu 15:59] =>  0:26
   CLOCK: [2014-02-18 Tue 11:17]--[2014-02-18 Tue 11:25] =>  0:08
   CLOCK: [2014-02-17 Mon 20:09]--[2014-02-17 Mon 20:24] =>  0:15
   CLOCK: [2014-02-16 Sun 20:05]--[2014-02-16 Sun 20:21] =>  0:16
   CLOCK: [2014-02-16 Sun 19:36]--[2014-02-16 Sun 20:01] =>  0:25
   CLOCK: [2014-02-16 Sun 19:10]--[2014-02-16 Sun 19:20] =>  0:10
   CLOCK: [2014-02-04 Tue 16:16]--[2014-02-04 Tue 16:18] =>  0:02
   CLOCK: [2014-02-04 Tue 15:42]--[2014-02-04 Tue 16:16] =>  0:34
   CLOCK: [2014-01-28 Tue 16:29]--[2014-01-28 Tue 16:35] =>  0:06
   CLOCK: [2014-01-28 Tue 15:58]--[2014-01-28 Tue 16:09] =>  0:11
   CLOCK: [2014-01-27 Mon 13:52]--[2014-01-27 Mon 14:13] =>  0:21
   :END:
   - http://msnyder.info/posts/2011/07/lisp-for-the-web-part-ii/
** move common functionality (including (partial) views)
   - [ ] login
** [refactor] utils/list/make-set
   - rename to remove-duplicates
   - why is it needed in model/article/get-active-articles (the original list already does not contain duplicates)
   - and other places too? ???
** TODO [bug] image-upload should convert transparent background to white
   :CLOCK:
   CLOCK: [2014-02-13 Thu 15:44]--[2014-02-13 Thu 16:11] =>  0:27
   CLOCK: [2014-02-13 Thu 14:18]--[2014-02-13 Thu 15:11] =>  0:53
   :END:
** TODO move from ./locale to cl-locale
   :CLOCK:
   CLOCK: [2014-02-14 Fri 13:21]--[2014-02-14 Fri 13:38] =>  0:17
   :END:
** Archive                                                          :ARCHIVE:
*** DONE [bug] image resizing output is not good
    CLOSED: [2014-01-30 Thu 20:12]
    :PROPERTIES:
    :ARCHIVE_TIME: 2014-01-30 Thu 20:12
    :END:
*** DONE separate tests into different system
    CLOSED: [2014-02-13 Thu 17:48]
    :CLOCK:
    CLOCK: [2014-02-13 Thu 17:42]--[2014-02-13 Thu 17:48] =>  0:06
    :END:
    :PROPERTIES:
    :ARCHIVE_TIME: 2014-02-13 Thu 17:48
    :END:
*** DONE memoize
    CLOSED: [2014-02-14 Fri 13:19]
    :CLOCK:
    CLOCK: [2014-02-14 Fri 13:08]--[2014-02-14 Fri 13:19] =>  0:11
    CLOCK: [2014-02-13 Thu 17:49]--[2014-02-13 Thu 18:14] =>  0:25
    CLOCK: [2014-02-13 Thu 17:07]--[2014-02-13 Thu 17:28] =>  0:21
    CLOCK: [2014-02-13 Thu 16:28]--[2014-02-13 Thu 17:04] =>  0:36
    CLOCK: [2014-02-13 Thu 16:12]--[2014-02-13 Thu 16:23] =>  0:11
    CLOCK: [2014-02-11 Tue 17:26]--[2014-02-11 Tue 17:31] =>  0:05
    CLOCK: [2014-02-11 Tue 16:43]--[2014-02-11 Tue 17:24] =>  0:41
    :END:
    :PROPERTIES:
    :ARCHIVE_TIME: 2014-02-14 Fri 13:19
    :END:
*** DONE ensure *mem-map* does not conflict (is not overwritten) from different projects
    CLOSED: [2014-02-14 Fri 14:55]
    :CLOCK:
    CLOCK: [2014-02-14 Fri 14:45]--[2014-02-14 Fri 14:55] =>  0:10
    CLOCK: [2014-02-14 Fri 13:35]--[2014-02-14 Fri 14:10] =>  0:35
    :END:
    :PROPERTIES:
    :ARCHIVE_TIME: 2014-02-14 Fri 14:59
    :END:
    - especially due to clr-memoize
    - check for other web-utils global params too
